{"timestamp":1744208619,"lastUpdated":"2025-04-09 16:23:39","wfo":"MHX","content":"<p> 418 FXUS62 KMHX 091055 AFDMHX<\/p>\n<p>Area Forecast Discussion National Weather Service Newport\/Morehead City NC 655 AM EDT Wed Apr 9 2025<\/p>\n<p>.SYNOPSIS... High pressure builds in from the west today with another frontal system late week. High pressure then builds in again for the weekend.<\/p>\n<p>.NEAR TERM \/UNTIL 6 PM THIS EVENING\/... As of 7 AM Wednesday...Cool high pressure will continue to build over the area as flow becomes more zonal aloft across the Carolinas. Low level thickness values, mostly sunny skies and E-NE flow will keep high temps in the 50s along the Outer Banks and low 60s inland.<\/p>\n<p>.SHORT TERM \/6 PM THIS EVENING THROUGH 6 AM THURSDAY\/... As of 7 AM Wednesday...Arctic high pressure will continue to influence weather over the Carolinas through Wednesday night, continuing a brief run of below average temperatures. Stuck with the lower end of guidance, given clear skies, calm winds, and lingering lower dewpoints for tonight resulting in great radiational cooling conditions. Stratocu starts moving in over coastal communities from the east early morning Thursday. Lows in the upper 30s inland, 40s for beaches.<\/p>\n<p>.LONG TERM \/THURSDAY THROUGH TUESDAY\/... As of 315 AM Wednesday...A largely quiet period of weather is forecast for eastern North Carolina in the long term, punctuated by a period of wet and potentially stormy conditions to end the week. Temperatures will run near to slightly below average through the weekend, rebounding to modestly above average to kick off the new week.<\/p>\n<p>Thursday...Dry conditions expected to start the day as today`s high pressure quickly lifts into the northern Atlantic, ceding ground to low pressure diving towards the Carolinas Thurs evening ahead of deep mid-level troughing. With SE return flow, temps will warm to near normal with highs in the low to mid 70s inland and mid to upper 60s along the coast.<\/p>\n<p>Thursday night through Saturday...Trough will continue to dig towards the Carolinas overnight with surface low progged to move roughly across the NC\/VA state line on Friday. Guidance continues to come into good agreement on timing and placement of the parent low, with the main cold front forecast to cross late Fri into Sat AM. Shower activity may begin across the coastal plain as early as Thursday night, but the most likely period of precipitation remains Friday. Given increasing confidence, expanded area of categorical PoPs, continuing to favor areas farther north. Healthy cloud cover on Friday will keep temps tempered, in the upper 60s to low 70s, but with Tds near 60 there remains a window for some instability Fri afternoon as CAPEs climb to 500-750 J\/kg. Thus, continued a tstorm mention areawide. Increase in deep layer shear may contribute to a low- end severe risk on Friday, although the modest instability will be a limiting factor.<\/p>\n<p>Upper low will move overhead on Saturday, and despite the front and surface low moving offshore steepening lapse rates in the afternoon and lingering pool of moisture do hint some iso to widely sct shower development. Given limited coverage, kept rain chances at slight chance for now.<\/p>\n<p>Sunday through Tuesday...The upper low should be offshore by Sunday with upper ridging and sfc high pressure building in from the southwest, keeping conditions dry but warmer through Tuesday. Ensemble guidance does hint at a fast- moving front approaching the region on Tuesday, although confidence in any associated precip is low.<\/p>\n<p>.AVIATION \/12Z WEDNESDAY THROUGH SUNDAY\/... SHORT TERM \/through 6Z Thursday\/... As of 7 AM Tue...VFR conditions expected through the period. Clear skies through the CWA as high builds in through the morning hours. Surge in north\/northeast breezes this morning with tightened pressure gradient from high, though should remain at or below 15 kt over mainland ENC. Exception of OBX where gusts up to 25-30mph are possible this morning. The northeasterly breeze becomes more easterly through the day though only in the 10-15 kt range. Winds decrease substantially for Wednesday night and skies remain generally clear inland, with some stratocu moving in from the east for coastal communities as high moves offshore.<\/p>\n<p>LONG TERM \/Thursday through Sunday\/... As of 320 AM Wednesday...High pressure slides offshore Thursday, with pred VFR conditions expected. An upper low will approach the area late in the week bringing the potential for sub-VFR conditions, especially in showers and thunderstorms, Thursday night and Friday. Periods of MVFR are probable Saturday while upper low lingers over the area, but return of ridging and high pressure ushers in predominantly VFR for Sunday and beyond.<\/p>\n<p>.MARINE... SHORT TERM \/through Wednesday night\/... As of 7 AM Wednesday...N\/NE winds 15-25 kts with some gusts near 30 kts this morning from a tightened pressure gradient as high builds to our north and weak low lingers to our south. SCA for coastal waters from Surf City to Ocracoke Inlet from 10-17Z today, as the southern half of the CWA will see best chances of prolonged gusts at or above 25 kts. As you go further north, duration and intensity of SCA gusts decreases for this morning. MWS has been issued for Pamlico, Albemarle, Croatan, Roanoke Sounds, Neuse and Alligator River, and Coastal waters from Oregon Inlet to Duck for NE winds gusting up to 30 kts. SCA continues for the northern and central waters through the morning for lingering 6 ft seas and this surge of NE winds. Elsewhere, seas 3-5 ft expected through today. Tonight, winds remain generally easterly 10-15 kts and seas continue dropping, becoming 2-4 ft.<\/p>\n<p>LONG TERM \/Thursday through Sunday\/... As of 320 AM Wednesday...Generally quiet marine conditions are expected through the long term period. The high migrates offshore Thursday with winds becoming becoming southeasterly, then southerly by Thursday PM into Friday. Cold front will swing across the waters on Fri PM through Saturday, with winds veering back to the northwest through Sunday as upper low and surface cyclone exit over the open Atlantic. Ensemble guidance continues to point to low probabilities (less than 20%) of offshore SCA on Friday ahead of the cold front, but did increase slightly for Sat PM into Sun AM with a northwesterly surge. Seas expected to mainly be around 2-4 ft mid week, ticking up to 3-5 feet by week`s end. Some spotty 6 foot seas are possible across waters around 20 nm late Sunday with the aforementioned surge.<\/p>\n<p>.MHX WATCHES\/WARNINGS\/ADVISORIES... NC...Freeze Warning until 9 AM EDT this morning for NCZ029-044-079.      Beach Hazards Statement through this evening for NCZ203-205. MARINE...Small Craft Advisory until 11 AM EDT this morning for AMZ135.      Small Craft Advisory until 2 PM EDT this afternoon for AMZ152-      154.      Small Craft Advisory until 1 PM EDT this afternoon for AMZ156-      158.<\/p>\n<p>$$<\/p>\n<p>SYNOPSIS...MHX NEAR TERM...RJ SHORT TERM...RJ LONG TERM...MS AVIATION...MS\/RJ MARINE...MS\/RJ<\/p>\n<p><\/p>\n","raw":"\n418\nFXUS62 KMHX 091055\nAFDMHX\n\nArea Forecast Discussion\nNational Weather Service Newport\/Morehead City NC\n655 AM EDT Wed Apr 9 2025\n\n.SYNOPSIS...\nHigh pressure builds in from the west today with another\nfrontal system late week. High pressure then builds in again for\nthe weekend.\n\n&&\n\n.NEAR TERM \/UNTIL 6 PM THIS EVENING\/...\nAs of 7 AM Wednesday...Cool high pressure will continue to\nbuild over the area as flow becomes more zonal aloft across the\nCarolinas. Low level thickness values, mostly sunny skies and\nE-NE flow will keep high temps in the 50s along the Outer Banks\nand low 60s inland.\n\n&&\n\n.SHORT TERM \/6 PM THIS EVENING THROUGH 6 AM THURSDAY\/...\nAs of 7 AM Wednesday...Arctic high pressure will continue to\ninfluence weather over the Carolinas through Wednesday night,\ncontinuing a brief run of below average temperatures. Stuck with\nthe lower end of guidance, given clear skies, calm winds, and\nlingering lower dewpoints for tonight resulting in great\nradiational cooling conditions. Stratocu starts moving in over\ncoastal communities from the east early morning Thursday. Lows\nin the upper 30s inland, 40s for beaches.\n\n&&\n\n.LONG TERM \/THURSDAY THROUGH TUESDAY\/...\nAs of 315 AM Wednesday...A largely quiet period of weather is\nforecast for eastern North Carolina in the long term, punctuated\nby a period of wet and potentially stormy conditions to end the\nweek. Temperatures will run near to slightly below average\nthrough the weekend, rebounding to modestly above average to\nkick off the new week.\n\nThursday...Dry conditions expected to start the day as today`s\nhigh pressure quickly lifts into the northern Atlantic, ceding\nground to low pressure diving towards the Carolinas Thurs\nevening ahead of deep mid-level troughing. With SE return flow,\ntemps will warm to near normal with highs in the low to mid 70s\ninland and mid to upper 60s along the coast.\n\nThursday night through Saturday...Trough will continue to dig\ntowards the Carolinas overnight with surface low progged to move\nroughly across the NC\/VA state line on Friday. Guidance\ncontinues to come into good agreement on timing and placement of\nthe parent low, with the main cold front forecast to cross late\nFri into Sat AM. Shower activity may begin across the coastal\nplain as early as Thursday night, but the most likely period of\nprecipitation remains Friday. Given increasing confidence,\nexpanded area of categorical PoPs, continuing to favor areas\nfarther north. Healthy cloud cover on Friday will keep temps\ntempered, in the upper 60s to low 70s, but with Tds near 60\nthere remains a window for some instability Fri afternoon as\nCAPEs climb to 500-750 J\/kg. Thus, continued a tstorm mention\nareawide. Increase in deep layer shear may contribute to a low-\nend severe risk on Friday, although the modest instability will\nbe a limiting factor.\n\nUpper low will move overhead on Saturday, and despite the front\nand surface low moving offshore steepening lapse rates in the\nafternoon and lingering pool of moisture do hint some iso to\nwidely sct shower development. Given limited coverage, kept rain\nchances at slight chance for now.\n\nSunday through Tuesday...The upper low should be offshore by\nSunday with upper ridging and sfc high pressure building in from\nthe southwest, keeping conditions dry but warmer through\nTuesday. Ensemble guidance does hint at a fast- moving front\napproaching the region on Tuesday, although confidence in any\nassociated precip is low.\n\n&&\n\n.AVIATION \/12Z WEDNESDAY THROUGH SUNDAY\/...\nSHORT TERM \/through 6Z Thursday\/...\nAs of 7 AM Tue...VFR conditions expected through the period.\nClear skies through the CWA as high builds in through the\nmorning hours. Surge in north\/northeast breezes this morning\nwith tightened pressure gradient from high, though should remain\nat or below 15 kt over mainland ENC. Exception of OBX where\ngusts up to 25-30mph are possible this morning. The\nnortheasterly breeze becomes more easterly through the day\nthough only in the 10-15 kt range. Winds decrease substantially\nfor Wednesday night and skies remain generally clear inland,\nwith some stratocu moving in from the east for coastal\ncommunities as high moves offshore.\n\nLONG TERM \/Thursday through Sunday\/...\nAs of 320 AM Wednesday...High pressure slides offshore\nThursday, with pred VFR conditions expected. An upper low will\napproach the area late in the week bringing the potential for\nsub-VFR conditions, especially in showers and thunderstorms,\nThursday night and Friday. Periods of MVFR are probable Saturday\nwhile upper low lingers over the area, but return of ridging and\nhigh pressure ushers in predominantly VFR for Sunday and beyond.\n\n&&\n\n.MARINE...\nSHORT TERM \/through Wednesday night\/...\nAs of 7 AM Wednesday...N\/NE winds 15-25 kts with some gusts near\n30 kts this morning from a tightened pressure gradient as high\nbuilds to our north and weak low lingers to our south. SCA for\ncoastal waters from Surf City to Ocracoke Inlet from 10-17Z\ntoday, as the southern half of the CWA will see best chances of\nprolonged gusts at or above 25 kts. As you go further north,\nduration and intensity of SCA gusts decreases for this morning.\nMWS has been issued for Pamlico, Albemarle, Croatan, Roanoke\nSounds, Neuse and Alligator River, and Coastal waters from\nOregon Inlet to Duck for NE winds gusting up to 30 kts. SCA\ncontinues for the northern and central waters through the\nmorning for lingering 6 ft seas and this surge of NE winds.\nElsewhere, seas 3-5 ft expected through today. Tonight, winds\nremain generally easterly 10-15 kts and seas continue dropping,\nbecoming 2-4 ft.\n\n\nLONG TERM \/Thursday through Sunday\/...\nAs of 320 AM Wednesday...Generally quiet marine conditions are\nexpected through the long term period. The high migrates\noffshore Thursday with winds becoming becoming southeasterly,\nthen southerly by Thursday PM into Friday. Cold front will\nswing across the waters on Fri PM through Saturday, with winds\nveering back to the northwest through Sunday as upper low and\nsurface cyclone exit over the open Atlantic. Ensemble guidance\ncontinues to point to low probabilities (less than 20%) of\noffshore SCA on Friday ahead of the cold front, but did increase\nslightly for Sat PM into Sun AM with a northwesterly surge.\nSeas expected to mainly be around 2-4 ft mid week, ticking up to\n3-5 feet by week`s end. Some spotty 6 foot seas are possible\nacross waters around 20 nm late Sunday with the aforementioned\nsurge.\n\n&&\n\n.MHX WATCHES\/WARNINGS\/ADVISORIES...\nNC...Freeze Warning until 9 AM EDT this morning for NCZ029-044-079.\n     Beach Hazards Statement through this evening for NCZ203-205.\nMARINE...Small Craft Advisory until 11 AM EDT this morning for AMZ135.\n     Small Craft Advisory until 2 PM EDT this afternoon for AMZ152-\n     154.\n     Small Craft Advisory until 1 PM EDT this afternoon for AMZ156-\n     158.\n\n&&\n\n$$\n\nSYNOPSIS...MHX\nNEAR TERM...RJ\nSHORT TERM...RJ\nLONG TERM...MS\nAVIATION...MS\/RJ\nMARINE...MS\/RJ\n\n\n"}